package errors


const (

	ERR_TYPE_DBERR	= 1
	ERR_TYPE_COMMON = 2
)


const (
	//公共错误
	ERR_INVALID_TOKEN		= 10001
	ERR_INVALID_SITEID		= 10002
	ERR_INVALID_APPID		= 10003
	ERR_INVALID_APPKEY		= 10004
	ERR_INVALID_VERSION		= 10005
	ERR_ID_MISMATH			= 10006
	ERR_NO_INPUT			= 10007
	ERR_JSON_MARSHAL		= 10008
	ERR_JSON_UNMARSHAL		= 10009
	ERR_PANIC_ERROR			= 10010
	ERR_INVALID_SQLFILTER	= 10011
	ERR_INVALID_PATH    	= 10012
	ERR_INVALID_IPADDR    	= 10013

	//url参数错误
	ERR_PARAMS_NOT_MATCH		= 11001
	ERR_PARAMS_CREATE_PATIENT	= 11002


	//
	ERR_PARAMS_SEARCH_PATH		= 12001


	)




var Comm_Error = map[int]string{
	ERR_INVALID_TOKEN: 			"无效的token",
	ERR_INVALID_SITEID: 		"无效的租户标识",
	ERR_INVALID_APPID: 			"无效的appid",
	ERR_INVALID_APPKEY: 		"无效的appkey",
	ERR_INVALID_VERSION: 		"无效的版本号",
	ERR_ID_MISMATH: 			"ID不匹配",
	ERR_NO_INPUT: 				"没有输入条件",
	ERR_JSON_MARSHAL:			"json marshal错误",
	ERR_JSON_UNMARSHAL:			"json unmarshal错误",
	ERR_PANIC_ERROR:			"panic error",

	ERR_PARAMS_NOT_MATCH:		"携带的参数不符合要求",
	ERR_PARAMS_CREATE_PATIENT:	"不能创建patient信息",

	//
	ERR_PARAMS_SEARCH_PATH:	"设置schema路径失败",

}


var DB_Error = map[int]string{
	1004:  "无法创建文件",
	1005:  "无法创建表",
	1006:  "无法创建数据库",
	1007:  "无法创建数据库，数据库已存在。",
	1008:  "无法撤销数据库，数据库不存在。",
	1009:  "撤销数据库时出错",
	1010:  "撤销数据库时出错",
	1011:  "删除时出错",
	1012:  "无法读取系统表中的记录.",
	1013:  "无法获取的状态",
	1014:  "无法获得工作目录",
	1015:  "无法锁定文件",
	1016:  "无法打开文件",
	1017:  "无法找到文件",
	1018:  "无法读取的目录",
	1019:  "无法为更改目录",
	1020:  "自上次读取以来表中的记录已改变.",
	1021:  "磁盘满",
	1022:  "无法写入",
	1023:  "关闭时出错",
	1024:  "读取文件时出错",
	1025:  "将重命名为时出错",
	1026:  "写入文件时出错",
	1027:  "已锁定，拒绝更改.",
	1028:  "分类失败",
	1029:  "视图不存在。",
	1030:  "从存储引擎中获取错误。",
	1031:  "关于的表存储引擎不含该选项。",
	1032:  "无法在中找到记录。",
	1033:  "文件中的不正确信息",
	1034:  "对于表， 键文件不正确，请尝试修复。",
	1035:  "旧的键文件，对于表，请修复之！",
	1036:  "表是只读的。",
	1037:  "内存溢出，重启服务器并再次尝试（需要字节）。",
	1038:  "分类内存溢出，增加服务器的分类缓冲区大小。",
	1039:  "读取文件时出现意外EOF ",
	1040:  "连接过多。",
	1041:  "内存溢出，请检查是否mysqld或其他进程使用了所有可用内存，如不然，或许应使用'ulimit允许mysqld使用更多内存，或增加交换空间的大小。",
	1042:  "无法获得该地址给出的主机名。",
	1043:  "不良握手",
	1044:  "拒绝用户访问数据库。",
	1045:  "拒绝用户的访问（使用密码***）",
	1046:  "未选择数据库。",
	1047:  "未知命令。",
	1048:  "列不能为空。",
	1049:  "未知数据库。",
	1050:  "表已存在。",
	1051:  "未知表。",
	1052:  "请求中的列不明确。",
	1053:  "在操作过程中服务器关闭。",
	1054:  "中的未知列。",
	1055:  "不在GROUP BY中。",
	1056:  "无法在上创建组。",
	1057:  "语句中有sum函数和相同语句中的列。",
	1058:  "列计数不匹配值计数。",
	1059:  "ID名称过长。",
	1060:  "重复列名。",
	1061:  "重复键名称。",
	1062:  "主键字段值的重复。",
	1063:  "对于列，列分类符不正确。",
	1064:  "在行xxx上，靠近。",
	1065:  "无效的SQL语句，SQL语句为空",
	1066:  "非唯一的表/别名",
	1067:  "关于的无效默认值。",
	1068:  "定义了多个主键。",
	1069:  "指定了过多键允许的最大键数。",
	1070:  "指定了过多键部分允许的最大键部分。",
	1071:  "指定的键过长，最大键长度字节。",
	1072:  "键列在表中不存在。",
	1073:  "BLOB列不能与已使用的表类型用在 键说明中。",
	1074:  "对于列，列长度过大 ",
	1075:  "不正确的表定义，只能有1个auto列，而且必须将其定义为 键。",
	1081: "不能建立Socket连接",
	1114: "数据表已满，不能容纳任何记录",
	1116: "打开的数据表太多",
	1129: "数据库出现异常，请重启数据库",
	1130: "连接数据库失败，没有连接数据库的权限",
	1133: "数据库用户不存在",
	1141: "当前用户无权访问数据库",
	1142: "当前用户无权访问数据表",
	1143: "当前用户无权访问数据表中的字段",
	1146: "数据表不存在",
	1147: "未定义用户对数据表的访问权限",
	1149: "SQL语句语法错误",
	1158: "网络错误，出现读错误，请检查网络连接状况",
	1159: "网络错误，读超时，请检查网络连接状况",
	1160: "网络错误，出现写错误，请检查网络连接状况",
	1161: "网络错误，写超时，请检查网络连接状况",
	1169: "字段值重复，更新记录失败",
	1177: "打开数据表失败",
	1180: "提交事务失败",
	1181: "回滚事务失败",
	1203: "当前用户和数据库建立的连接已到达数据库的最大连接数，请增大可用的数据库连接数或重启数据库",
	1205: "加锁超时",
	1211: "当前用户没有创建用户的权限",
	1216: "外键约束检查失败，更新子表记录失败",
	1217: "外键约束检查失败，删除或修改主表记录失败",
	1226: "当前用户使用的资源已超过所允许的资源，请重启数据库或重启服务器",
	1227: "权限不足，您无权进行此操作",
	1235: "MySQL版本过低，不具有本功能",
	1451: "该条记录已经被使用，有约束限制，不能删除",
	1452: "该条记录已经被使用，有约束限制，不能添加或更新子行",
	9999: "未知错误",
}